stress_test/reviews.yml
config:
  target: "http://localhost:3001/"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "Get All reviews of specific product"
    flow:
      - get:
        url: "/reviews"