stress_test/reviews.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 5
      arrivalRate: 20
      name: test
    - duration: 60
      arrivalRate: 100
      rampTo: 500
  processor: "./helper.js"
scenarios:
  - name: "Get All reviews of specific product"
    flow:
      - get:
          url: "/reviews/?product_id={{ id }}"